<!doctype html>
<html>
	<head>
		<title>Das Internet </title>
		<link rel="stylesheet" type="text/css" href="../css/styles.css"/>
	</head>
	<body>
		<h1>Das Internet</h1>
		
			<p>
				Das Internet ist, wie die Definition besagt, ein Netzwerk bestehend 
				aus allen Computern und sonstigen Ger&auml;ten, die weltweit miteinander 
				kommunizieren k&ouml;nnen. Daher auch der Namen &bdquo;World Wide Web&ldquo;, welcher 
				in jeder Domain vertreten ist. Mittels des Internets kann jeder Mensch, 
				der &uuml;ber ein Internetf&auml;higes Ger&auml;t und einen Netzwerkanschluss verf&uuml;gt, 
				unz&auml;hlige Informationsquellen, Datenbanken und Online-Dienste zugreifen. 
				Das World Wide Web gilt als die schnellste und modernste 
				Kommunikationsplattform der Welt.<br />
				<br /> 
				Das Internet funktioniert mittels zwei Arten von Computerverbindungen. 
				Es gibt die &rdquo;LAN-Verbindung&ldquo;, die Abk&uuml;rzung f&uuml;r &bdquo;Local Area Network&ldquo;. 
				Sie bezeichnet Computer, die sich in der N&auml;he zueinander befinden und 
				zwischen sich und anderen Ger&auml;ten Informationen teilen. Die zweite Art 
				wird als &bdquo;WAN-Verbindung&ldquo; bezeichnet, die Kurzfassung f&uuml;r &bdquo;Wide Area Network&ldquo;, 
				welche die Kommunikation zweier oder mehrere Ger&auml;te &uuml;ber gr&ouml;&szlig;ere Distanz erm&ouml;glicht. 
				Diese entstehenden Verbindungen, also die Netzwerke, werden &uuml;ber Server miteinander 
				verbunden.<br /> 
				<br />
				<img src="../img/server.png" height="300" width="600"/> <!-- "../" eins hoch-->
				<br />
				Server sind im Endeffekt nur Computer, die Informationen speichern. 
				Daher, werden im Internet abrufbare Seiten auf diesen Servern gespeichert. 
				Ruft man nun eine Website &uuml;ber seinen Browser auf, zum Beispiel Mozilla Firefox, 
				schickt der Browser eine Anfrage an den Server, ihm den Zugang zur Seite und 
				den Informationen zu erlauben. Der Server gibt darauf, falls nicht gesch&uuml;tzt 
				durch Passw&ouml;rter oder sonstige Sicherungen, dem Computer die Zugriffserlaubnis, 
				wodurch der Computer nun zum &bdquo;Klienten&ldquo; wird. Im Anschluss daran werden dann 
				die Informationen der Seite in dem Browser dargestellt und man kann auf die 
				Seite vollst&auml;ndig zugreifen.<br />
				
				<!-- &rdquo; Anführungszeicen beginn, &ldquo; Anführungszecinen Ende, &szlig; Scharfes S,-->
				<br />
		
			</p>
			<p>
			<h4><a href="../index.htm">Zur&uumlck zur Startseite</h4>
			
			</p>
	
	
	
	
	
	
	
	
	
	
	
	
	
	</body>
</html>










